<?php
/**
 * mongodb日志编码代码表
 * log_type_id
 * Author: lirong
 * Date: 2017/7/19
 * Time: 13:54
 */
return [

    //支付类  fenxiao_pay
    '100001' =>'订单异步通知信息',
    '100002' =>'会员升级异步通知信息',

    //订单处理类 fenxiao_orders
    '200000'=>'销售录单成功',
    '200001'=>'销售录单失败',
    '200010'=>'会员升级失败',
    '200011'=>'会员升级成功',
    '200020'=>'在线订购订单失败',
    '200021'=>'在线订购订单成功',
    '200030'=>'订异步通知处理失败',
    '200031'=>'订异步通知处理成功',
    '200040'=>'会员订异步通知处理失败',
    '200041'=>'会员订异步通知处理成功',
    '200050'=>'手动入账订单处理失败',
    '200051'=>'手动入账订单处理成功',


    //日常操作类 fenxiao_logs
    '300000' =>'账户冻结失败',
    '300001' =>'账户解冻失败',
    '300002' =>'添加代理失败',
    '300003' =>'添加代理成功',
    '300004' =>'代理冻结成功',

    //账户操作类  fenxiao_account
    '400000'=>'提现操作失败',
    '400010'=>'修改账号支付密码失败',
    '400011'=>'修改账号支付密码成功',
    '400020'=>'后台提现操作失败',
    '400021'=>'后台提现操作成功',
    '400030'=>'后台提现操作失败',
    '400031'=>'后台提现操作成功',
    '400040'=>'账户余额增加失败',
    '400041'=>'账户余额增加成功',
    '400050'=>'账户冻结失败',
    '400050'=>'账户解冻失败',
    '400800'=>'CRC账号冻结日志',

    //登录日志类 fenxiao_login
    '500000'=>'WAP接口登录超时',
    '500001'=>'WAP接口登录成功',
    '500010'=>'WAP接口注册失败',
    '500011'=>'WAP接口注册成功',
    '500020'=>'项目添加失败',
    '500021'=>'项目添加成功',

    //商品日志类 fenxiao_goods
    '600000'=>'商品信息处理',
    '600001'=>'商品信息处理',
    '600010'=>'确认收货失败',
    '600011'=>'确认收货成功',
    '600020'=>'自动确认收货失败',
    '600021'=>'自动确认收货成功',
    '600030'=>'自动关闭订单失败',
    '600031'=>'自动关闭订单成功',

    //接口日志类 fenxiao_interface
    '700000' =>'登录接口日志',
    '700001' =>'收货接口日志',
    '700002' =>'订单异步通知日志',
    '700003' =>'获取订单详情开始日志',
    '700004' =>'获取订单详情返回日志',
    '700005' =>'获取用户信息日志',

    //资金操作类 fenxiao_account
    '800000'=>'余额提现失败',
    '800001'=>'余额提现成功',
    '800010'=>'订单分润计算失败',
    '800011'=>'订单分润计算成功',
    '800012'=>'订单分润计算其他',

    //队列日志类
    '900000'=>'队列循环计算订单失败',
    '900001'=>'队列循环计算订单成功',
    '900012'=>'队列循环计算其他日志',

    //定义编码对应的日志表名
    'collections'=>[
        '100'   =>  'fenxiao_pay',
        '200'   =>  'fenxiao_orders',
        '300'   =>  'fenxiao_logs',
        '400'   =>  'fenxiao_account',
        '500'   =>  'fenxiao_login',
        '600'   =>  'fenxiao_goods',
        '800'   =>  'fenxiao_account',
        '700'   =>  'fenxiao_interface',
        '900'   =>  'fenxiao_tasklist'
    ]

];